Joghaimi/PMM/Custom_Board/1.8.11/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# PMM0620 (Prorgamming Port)
# ---------------------------------------
PMM0620_edbg.name=PMM0620 (Programming Port)
PMM0620_edbg.vid.0=0x03eb
PMM0620_edbg.pid.0=0x2157

PMM0620_edbg.upload.tool=openocd
PMM0620_edbg.upload.protocol=sam-ba
PMM0620_edbg.upload.maximum_size=262144
PMM0620_edbg.upload.maximum_data_size=32768
PMM0620_edbg.upload.use_1200bps_touch=false
PMM0620_edbg.upload.wait_for_upload_port=false
PMM0620_edbg.upload.native_usb=false
PMM0620_edbg.build.mcu=cortex-m0plus
PMM0620_edbg.build.f_cpu=48000000L
PMM0620_edbg.build.usb_product="PMM0620"
PMM0620_edbg.build.usb_manufacturer="PMM LLC"
PMM0620_edbg.build.board=PMM0620
PMM0620_edbg.build.core=arduino
PMM0620_edbg.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0620_edbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0620_edbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0620_edbg.build.variant=PMM0620
PMM0620_edbg.build.variant_system_lib=
PMM0620_edbg.build.vid=0x2341
PMM0620_edbg.build.pid=0x804d
PMM0620_edbg.bootloader.tool=openocd
PMM0620_edbg.bootloader.file=zero/samd21_sam_ba.bin

# PMM0620 (Native USB Port)
# --------------------------------------
PMM0620_native.name=PMM0620 (Native USB Port)
PMM0620_native.vid.0=0x2341
PMM0620_native.pid.0=0x804d
PMM0620_native.vid.1=0x2341
PMM0620_native.pid.1=0x004d
PMM0620_native.vid.2=0x2341
PMM0620_native.pid.2=0x824d
PMM0620_native.vid.3=0x2341
PMM0620_native.pid.3=0x024d

PMM0620_native.upload.tool=bossac
PMM0620_native.upload.protocol=sam-ba
PMM0620_native.upload.maximum_size=262144
PMM0620_native.upload.maximum_data_size=32768
PMM0620_native.upload.use_1200bps_touch=true
PMM0620_native.upload.wait_for_upload_port=true
PMM0620_native.upload.native_usb=true
PMM0620_native.build.mcu=cortex-m0plus
PMM0620_native.build.f_cpu=48000000L
PMM0620_native.build.usb_product="PMM0620"
PMM0620_native.build.usb_manufacturer="Arduino LLC"
PMM0620_native.build.board=PMM0620
PMM0620_native.build.core=arduino
PMM0620_native.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0620_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0620_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0620_native.build.variant=PMM0620
PMM0620_native.build.variant_system_lib=
PMM0620_native.build.vid=0x2341
PMM0620_native.build.pid=0x804d
PMM0620_native.bootloader.tool=openocd
PMM0620_native.bootloader.file=zero/samd21_sam_ba.bin

# Arduino MKR1000
# -----------------------
mkr1000.name=Arduino MKR1000
mkr1000.vid.0=0x2341
mkr1000.pid.0=0x804e
mkr1000.vid.1=0x2341
mkr1000.pid.1=0x004e
mkr1000.vid.2=0x2341
mkr1000.pid.2=0x824e
mkr1000.vid.3=0x2341
mkr1000.pid.3=0x024e

mkr1000.upload.tool=bossac
mkr1000.upload.protocol=sam-ba
mkr1000.upload.maximum_size=262144
mkr1000.upload.maximum_data_size=32768
mkr1000.upload.use_1200bps_touch=true
mkr1000.upload.wait_for_upload_port=true
mkr1000.upload.native_usb=true
mkr1000.build.mcu=cortex-m0plus
mkr1000.build.f_cpu=48000000L
mkr1000.build.usb_product="Arduino MKR1000"
mkr1000.build.usb_manufacturer="PMM LLC"
mkr1000.build.board=SAMD_MKR1000
mkr1000.build.core=arduino
mkr1000.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
mkr1000.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkr1000.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkr1000.build.variant=mkr1000
mkr1000.build.vid=0x2341
mkr1000.build.pid=0x804e
mkr1000.bootloader.tool=openocd
mkr1000.bootloader.file=mkr1000/samd21_sam_ba_arduino_mkr1000.bin

# Arduino MKRZero
# ---------------
mkrzero.name=Arduino MKRZERO
mkrzero.vid.0=0x2341
mkrzero.pid.0=0x804f
mkrzero.vid.1=0x2341
mkrzero.pid.1=0x004f

mkrzero.upload.tool=bossac
mkrzero.upload.protocol=sam-ba
mkrzero.upload.maximum_size=262144
mkrzero.upload.maximum_data_size=32768
mkrzero.upload.use_1200bps_touch=true
mkrzero.upload.wait_for_upload_port=true
mkrzero.upload.native_usb=true
mkrzero.build.mcu=cortex-m0plus
mkrzero.build.f_cpu=48000000L
mkrzero.build.usb_product="Arduino MKRZero"
mkrzero.build.usb_manufacturer="Arduino LLC"
mkrzero.build.board=SAMD_MKRZERO
mkrzero.build.core=arduino
mkrzero.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
mkrzero.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrzero.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrzero.build.variant=mkrzero
mkrzero.build.vid=0x2341
mkrzero.build.pid=0x804f
mkrzero.bootloader.tool=openocd
mkrzero.bootloader.file=mkrzero/samd21_sam_ba_arduino_mkrzero.bin

# Arduino MKR WiFi 1010
# --------------------
mkrwifi1010.name=Arduino MKR WiFi 1010
mkrwifi1010.vid.0=0x2341
mkrwifi1010.pid.0=0x8054
mkrwifi1010.vid.1=0x2341
mkrwifi1010.pid.1=0x0054

mkrwifi1010.upload.tool=bossac
mkrwifi1010.upload.protocol=sam-ba
mkrwifi1010.upload.maximum_size=262144
mkrwifi1010.upload.maximum_data_size=32768
mkrwifi1010.upload.use_1200bps_touch=true
mkrwifi1010.upload.wait_for_upload_port=true
mkrwifi1010.upload.native_usb=true
mkrwifi1010.build.mcu=cortex-m0plus
mkrwifi1010.build.f_cpu=48000000L
mkrwifi1010.build.usb_product="Arduino MKR WiFi 1010"
mkrwifi1010.build.usb_manufacturer="Arduino LLC"
mkrwifi1010.build.board=SAMD_MKRWIFI1010
mkrwifi1010.build.core=arduino
mkrwifi1010.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
mkrwifi1010.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrwifi1010.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrwifi1010.build.variant=mkrwifi1010
mkrwifi1010.build.vid=0x2341
mkrwifi1010.build.pid=0x8054
mkrwifi1010.bootloader.tool=openocd
mkrwifi1010.bootloader.file=mkrwifi1010/samd21_sam_ba_arduino_mkrwifi1010.bin
#mkrwifi1010.arduinoota.extraflags=-d

# Arduino NANO 33 IoT
# --------------------
nano_33_iot.name=Arduino NANO 33 IoT
nano_33_iot.vid.0=0x2341
nano_33_iot.pid.0=0x8057
nano_33_iot.vid.1=0x2341
nano_33_iot.pid.1=0x0057

nano_33_iot.upload.tool=bossac
nano_33_iot.upload.protocol=sam-ba
nano_33_iot.upload.maximum_size=262144
nano_33_iot.upload.maximum_data_size=32768
nano_33_iot.upload.use_1200bps_touch=true
nano_33_iot.upload.wait_for_upload_port=true
nano_33_iot.upload.native_usb=true
nano_33_iot.build.mcu=cortex-m0plus
nano_33_iot.build.f_cpu=48000000L
nano_33_iot.build.usb_product="Arduino NANO 33 IoT"
nano_33_iot.build.usb_manufacturer="Arduino LLC"
nano_33_iot.build.board=SAMD_NANO_33_IOT
nano_33_iot.build.core=arduino
nano_33_iot.build.extra_flags=-DCRYSTALLESS -D__SAMD21G18A__ {build.usb_flags}
nano_33_iot.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
nano_33_iot.build.openocdscript=openocd_scripts/arduino_zero.cfg
nano_33_iot.build.variant=nano_33_iot
nano_33_iot.build.vid=0x2341
nano_33_iot.build.pid=0x8057
nano_33_iot.bootloader.tool=openocd
nano_33_iot.bootloader.file=nano_33_iot/samd21_sam_ba_arduino_nano_33_iot.bin

# Arduino MKR FOX 1200
# --------------------
mkrfox1200.name=Arduino MKR FOX 1200
mkrfox1200.vid.0=0x2341
mkrfox1200.pid.0=0x8050
mkrfox1200.vid.1=0x2341
mkrfox1200.pid.1=0x0050

